var area = [
    {  pname:"北京",
        cname: ["北京"]
    },
    
      {
          pname:"天津",
          cname:["天津"]
      },
      {
        pname:"河北",
        cname:["石家庄","唐山","秦皇岛","邯郸","邢台","保定","张家口","承德","沧州","廊坊","衡水"]
    },
    {
        pname:"山西",
        cname:["太原","大同","阳泉","长治","晋城","朔州","晋中","运城","忻州","临汾","吕梁"]
    },
    {
        pname:"内蒙古",
        cname:["呼和浩特","包头","乌海","赤峰","通辽","鄂尔多斯","呼伦贝尔","巴彦淖尔","乌兰察布","兴安","锡林郭勒","阿拉善"]
    },
    {
        pname:"辽宁",
        cname:["沈阳","大连","鞍山","抚顺","本溪","丹东","锦州","营口","阜新","辽阳","盘锦","铁岭","朝阳","葫芦岛"]
    },
    {
        pname:"吉林",
        cname:["长春","吉林","四平","辽源","通化","白山","松原","白城","延边"]
    },
    {
        pname:"黑龙江",
        cname:["哈尔滨","齐齐哈尔","鸡西市","鹤岗","双鸭山","大庆","伊春","佳木斯","七台河","牡丹江","黑河","绥化","大兴安岭"]
    },
    {
        pname:"上海",
        cname:["上海"]
    }, {
        pname:"江苏",
        cname:["南京","无锡","徐州","常州","苏州","南通","连云港","淮安","盐城","扬州","镇江","泰州","宿迁"]
    }, {
        pname:"浙江",
        cname:["杭州","宁波","温州","嘉兴","湖州","绍兴","金华","衢州","舟山","台州","丽水"]
    }, {
        pname:"安徽",
        cname:["合肥","芜湖","蚌埠","淮南","马鞍山","淮北","铜陵","安庆","黄山","滁州","阜阳","宿州","巢湖","六安","亳州","池州","宣城"]
    }, {
        pname:"福建",
        cname:["福州","厦门","莆田","三明","泉州","漳州","南平","龙岩","宁德"]
    }, {
        pname:"江西",
        cname:["南昌","景德镇","萍乡","九江","新余","鹰潭","赣州","吉安","宜春","抚州","上饶"]
    }, {
        pname:"山东",
        cname:["济南","青岛","淄博","枣庄","东营","烟台","潍坊","济宁","泰安","威海","日照","莱芜","临沂","德州","聊城","滨州","菏泽"]
    }, {
        pname:"河南",
        cname:["郑州","开封","洛阳","平顶山","安阳","鹤壁","新乡","焦作","濮阳","许昌","漯河","三门峡","南阳","商丘","信阳","周口","驻马店"]
    }, {
        pname:"湖北",
        cname:["武汉","黄石","十堰","宜昌","襄樊","鄂州","荆门","孝感","荆州","黄冈","咸宁","随州","恩施","神农架"]
    }, {
        pname:"湖南",
        cname:["长沙","株洲","湘潭","衡阳","邵阳","岳阳","常德","张家界","益阳","郴州","永州","怀化","娄底","湘西"]
    }, {
        pname:"广东",
        cname:["广州","深圳","珠海","汕头","韶关","佛山","江门","湛江","茂名","肇庆","惠州","梅州","汕尾","河源","阳江","清远","东莞","中山","潮州","揭阳","云浮"]
    },
     {
        pname:"广西",
        cname:["南宁","柳州","桂林","梧州","北海","防城港","钦州","贵港","玉林","百色","贺州","河池","来宾","崇左"]
    },
    {
        pname:"海南",
        cname:["海口","三亚"]
    },  {
        pname:"重庆",
        cname:["重庆"]
    },  {
        pname:"四川",
        cname:["成都","自贡","攀枝花","泸州","德阳","绵阳","广元","遂宁","内江","乐山","南充","眉山","宜宾","广安","达州","雅安","巴中","资阳","阿坝","甘孜","凉山"]
    },  {
        pname:"贵州",
        cname:["贵阳","六盘水","遵义","安顺","铜仁","黔西","毕节","黔东","黔南"]
    },  {
        pname:"云南",
        cname:["昆明","曲靖","玉溪","保山","昭通","丽江","思茅","临沧","楚雄","红河","文山","西双版纳","大理","德宏","怒江","迪庆"]
    },  {
        pname:"西藏",
        cname:["拉萨","昌都","山南","日喀则","那曲","阿里","林芝"]
    },  {
        pname:"陕西",
        cname:["西安","铜川","宝鸡","咸阳","渭南","延安","汉中","榆林","安康","商洛"]
    },
    {
        pname:"甘肃",
        cname:["兰州","嘉峪关","金昌","白银","天水","武威","张掖","平凉","酒泉","庆阳","定西","陇南","临夏回族自治州","甘南藏族自治州"]
    },  {
        pname:"青海",
        cname:["西宁","海东","海北","黄南","海南藏族","果洛","玉树","海西"]
    },  {
        pname:"宁夏",
        cname:["银川","石嘴山","吴忠","固原","中卫"]
    },  {
        pname:"新疆",
        cname:["乌鲁木齐","克拉玛依","吐鲁番","哈密","昌吉","博尔塔拉","巴音郭楞","阿克苏","克孜勒苏柯尔克孜","喀什","和田","伊犁哈萨克","塔城","阿勒泰","石河子","阿拉尔","图木舒克","五家渠"]
    },  {
        pname:"台湾",
        cname:["台北"]
    },  {
        pname:"香港",
        cname:["香港"]
    },
    {
        pname:"澳门",
        cname:["澳门"]
    }
     
];

var oyher=[
    {  
        "重庆":["重庆"]
    },
     {
        "福建":["福州","厦门","莆田","三明","泉州","漳州","南平","龙岩","宁德"]
    },
     {
        "甘肃":["兰州","嘉峪关","金昌","白银","天水","武威","张掖","平凉","酒泉","庆阳","定西","陇南","临夏回族自治州","甘南藏族自治州"],
        "广东":["广州","深圳","珠海","汕头","韶关","佛山","江门","湛江","茂名","肇庆","惠州","梅州","汕尾","河源","阳江","清远","东莞","中山","潮州","揭阳","云浮"],
        "广西":["南宁","柳州","桂林","梧州","北海","防城港","钦州","贵港","玉林","百色","贺州","河池","来宾","崇左"],
        "贵州":["贵阳","六盘水","遵义","安顺","铜仁","黔西","毕节","黔东","黔南"]
    },
     {
        "海南":["海口","三亚"],
        "河北":["石家庄","唐山","秦皇岛","邯郸","邢台","保定","张家口","承德","沧州","廊坊","衡水"],
        "河南":["郑州","开封","洛阳","平顶山","安阳","鹤壁","新乡","焦作","濮阳","许昌","漯河","三门峡","南阳","商丘","信阳","周口","驻马店"],
        "黑龙江":["哈尔滨","齐齐哈尔","鸡西市","鹤岗","双鸭山","大庆","伊春","佳木斯","七台河","牡丹江","黑河","绥化","大兴安岭"],
        "湖北":["武汉","黄石","十堰","宜昌","襄樊","鄂州","荆门","孝感","荆州","黄冈","咸宁","随州","恩施","神农架"],
        "湖南":["长沙","株洲","湘潭","衡阳","邵阳","岳阳","常德","张家界","益阳","郴州","永州","怀化","娄底","湘西"]
    },
     {
        "吉林":["长春","吉林","四平","辽源","通化","白山","松原","白城","延边"],
        "江苏":["南京","无锡","徐州","常州","苏州","南通","连云港","淮安","盐城","扬州","镇江","泰州","宿迁"],
        "江西":["南昌","景德镇","萍乡","九江","新余","鹰潭","赣州","吉安","宜春","抚州","上饶"]
    },
     {
        "辽宁":["沈阳","大连","鞍山","抚顺","本溪","丹东","锦州","营口","阜新","辽阳","盘锦","铁岭","朝阳","葫芦岛"]
    },
     {
        "内蒙古":["呼和浩特","包头","乌海","赤峰","通辽","鄂尔多斯","呼伦贝尔","巴彦淖尔","乌兰察布","兴安","锡林郭勒","阿拉善"],
        "宁夏":["银川","石嘴山","吴忠","固原","中卫"]
    },
     {
        "青海":["西宁","海东","海北","黄南","海南藏族","果洛","玉树","海西"]
    },
     {
        "山东":["济南","青岛","淄博","枣庄","东营","烟台","潍坊","济宁","泰安","威海","日照","莱芜","临沂","德州","聊城","滨州","菏泽"],
        "山西":["太原","大同","阳泉","长治","晋城","朔州","晋中","运城","忻州","临汾","吕梁"],
        "陕西":["西安","铜川","宝鸡","咸阳","渭南","延安","汉中","榆林","安康","商洛"],
        "上海":["上海"], 
        "四川":["成都","自贡","攀枝花","泸州","德阳","绵阳","广元","遂宁","内江","乐山","南充","眉山","宜宾","广安","达州","雅安","巴中","资阳","阿坝","甘孜","凉山"]
    },
     {
        "天津": ["天津"]
    },
    {
        "西藏":["拉萨","昌都","山南","日喀则","那曲","阿里","林芝"],
        "新疆":["乌鲁木齐","克拉玛依","吐鲁番","哈密","昌吉","博尔塔拉","巴音郭楞","阿克苏","克孜勒苏柯尔克孜","喀什","和田","伊犁哈萨克","塔城","阿勒泰","石河子","阿拉尔","图木舒克","五家渠"]
    },
     {
        "云南":["昆明","曲靖","玉溪","保山","昭通","丽江","思茅","临沧","楚雄","红河","文山","西双版纳","大理","德宏","怒江","迪庆"]
    },
     {
        "浙江":["杭州","宁波","温州","嘉兴","湖州","绍兴","金华","衢州","舟山","台州","丽水"]
    }
];

$(document).ready(function(){
  
    console.log("城市选择");

    proInit();
    $(".provinceList li").eq(0).addClass("on")
    createCity(0)

   


   $(".provinceList").on("click","li",function(){
   
    console.log("你点击了省份");
    $(this).addClass("on").siblings().removeClass("on");
    console.log("城市索引值index："+$(this).index());
    var ii=$(this).index();
    createCity(ii)
   });


   $(".cityList").on("click","li",function(){
     
         var cityname=$(this).text();
         console.log(cityname);
         
         $("#city").val(cityname);
         hideboard();

   });


});


function chooseCity(){
    $(".cover").show();
    $(".area").animate({
        "bottom":"0"
    },500);
    $("body").addClass("lockon")
}


function hideboard(){
    $(".cover").hide();
    $(".area").animate({
        "bottom":"-100%"
    },500);
    $("body").removeClass("lockon")
}


function proInit(){

    console.log("省级");
    //console.log(JSON.stringify(area) );
    var str="";
   for(var i=0;i<area.length;i++){
       str+="<li>"+area[i].pname+"</li>"
   }
   //console.log(str)
    $(".provinceList").append(str);
}

function createCity(index){

    console.log("城市:"+index);
    console.log(area[index]);
    var m=area[index].cname;
    var str="";
    for(var i=0;i<m.length;i++){
         str+="<li>"+m[i]+"</li>"
    }
   // console.log(str);
   
    $(".cityList").empty().append(str)


}